driver-tests/filebc/FileBCTests/FileBCJbi/test/FileWrite_Invoke/Input.xml

 + <soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="urn:oneway_persist"
    xmlns:xs="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
      <tns:helloObj>
         <tns:string>hello</tns:string>
         <tns:nonNegativeInteger>100</tns:nonNegativeInteger>
         <tns:byte>a</tns:byte>
         <tns:short>5</tns:short>
         <tns:int>12345</tns:int>
         <tns:long>12345</tns:long>
         <tns:negativeInteger>-100</tns:negativeInteger>
         <tns:dateTime>2000-03-10T19:38:05Z</tns:dateTime>
         <tns:nonPositiveInteger>0</tns:nonPositiveInteger>
         <tns:duration>P0Y0M0DT0H0M10S</tns:duration>
         <tns:ENTITIES>string byte short</tns:ENTITIES>
         <tns:double>1.111</tns:double>
         <tns:ENTITY>byte</tns:ENTITY>
         <tns:float>1.11</tns:float>
        </tns:helloObj>
     </soap:Body>
  </soap:Envelope>